content/posts/ex-hugo.md
---
title: "ox-hugo"
date: 2023-07-11T00:00:00+02:00
draft: false
---

## Write entries in org mode with ox-hugo {#write-entries-in-org-mode-with-ox-hugo}

I updated my Emacs config to accept ox-hugo. This is a Org sub-mode that allows org
documents to be exported as markup for hugo.  A new sub-directory contents-org was also
added to hold the org versions of the files. It is set up so that the files are
automatically converted to markup when saved.
